package jg.com.pubgolf.ui.view.navigation.screens

import androidx.compose.material.Text
import androidx.compose.runtime.Composable

@Composable
fun ProfileScreen() {
    /* TODO:
    делать тут не мало на самом деле
    попробуй сделать ui пока
    я не вывез
    я пока подключил шарды умер
    главная просьба наверн по ui
    любой переход на другую страницу делай активностью, а не навграфами
    так будет логичнее
    а так, что тут за ui будет - думай сам
    в плане
    по идее, тут должен быть список кнопок по типу
    профиль -> открывает активити с инфой о пользователе, которую можно поменять
    друзья -> открывает активити с инфой о друзьях (просто список, оставь его пустым, я вью модель потом напишу)
    хз, кнопка о нас -> оставь пока пустой
    и кнопка выйти, тоже оставь пока пустой


    еще мем
    когда будешь переходить на другие активити, закрывай предыдущие через finish()

    а, и постарайся сделать его больше модульным - то есть логически разбей на @composable функци, чтобы не было все в одном месте
    в идеале даже на файлики разбить, чтобы каждая активность была в своем файлике
    но тут как сам посчитаешь нужным
     */
    Text("Всевозможные настройки игрока")
}